#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.
```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/deep-thought/iac-github/runs/run-8iFHxfYdLZqZToXF

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
github_actions_organization_secret.axatol_aws_ecr_image_publisher_role_arn: Refreshing state... [id=AWS_ECR_IMAGE_PUBLISHER_ROLE_ARN]
github_organization_webhook.actions_runner_controller_axatol: Refreshing state... [id=397146175]
github_repository.axatol_home-assistant-integrations: Refreshing state... [id=home-assistant-integrations]
github_repository.axatol_actions: Refreshing state... [id=actions]
github_repository.axatol_jayd: Refreshing state... [id=youtube-dl]
github_repository_webhook.actions_runner_controller_hans-m-song-saml2aws: Refreshing state... [id=400589329]
github_repository_webhook.actions_runner_controller_hans-m-song-iac: Refreshing state... [id=398768556]
github_repository_webhook.actions_runner_controller_hans-m-song-kube-stack: Refreshing state... [id=397146056]
github_repository_webhook.actions_runner_controller_hans-m-song-huisheng: Refreshing state... [id=397854046]
github_repository.hans-m-song_iac: Refreshing state... [id=iac]
github_repository_webhook.actions_runner_controller_hans-m-song_blog: Refreshing state... [id=401172274]
github_repository.hans-m-song_blog: Refreshing state... [id=blog]
github_repository.hans-m-song_saml2aws: Refreshing state... [id=saml2aws]
github_repository.hans-m-song_huisheng: Refreshing state... [id=huisheng]
github_repository.hans-m-song_kube-stack: Refreshing state... [id=kube-stack]
github_repository.songmatrix_github: Refreshing state... [id=.github]
github_actions_organization_secret.songmatrix_aws_songmatrix_ecr_image_publisher_role_arn: Refreshing state... [id=AWS_SONGMATRIX_ECR_IMAGE_PUBLISHER_ROLE_ARN]
github_repository.songmatrix_frontend-web: Refreshing state... [id=frontend-web]
github_organization_webhook.actions_runner_controller_songmatrix: Refreshing state... [id=397146225]
github_repository.songmatrix_data-service: Refreshing state... [id=data-service]
github_repository.songmatrix_gateway: Refreshing state... [id=gateway]
github_repository.songmatrix_sync-service: Refreshing state... [id=sync-service]
github_repository_environment.hans-m-song_iac_auth0: Refreshing state... [id=iac:auth0]
github_repository_environment.hans-m-song_iac_aws: Refreshing state... [id=iac:aws]
github_actions_secret.hans-m-song_iac_aws_diff_role_arn: Refreshing state... [id=iac:AWS_DIFF_ROLE_ARN]
github_repository_environment.hans-m-song_iac_github: Refreshing state... [id=iac:github]
github_actions_secret.hans-m-song_iac_aws_deploy_role_arn: Refreshing state... [id=iac:AWS_DEPLOY_ROLE_ARN]
github_actions_secret.hans-m-song_iac_terraform_version: Refreshing state... [id=iac:TERRAFORM_VERSION]
github_actions_repository_oidc_subject_claim_customization_template.axatol["home-assistant-integrations"]: Refreshing state... [id=home-assistant-integrations]
github_actions_secret.hans-m-song_blog_aws_diff_role_arn: Refreshing state... [id=blog:AWS_DIFF_ROLE_ARN]
github_actions_secret.hans-m-song_blog_aws_deploy_role_arn: Refreshing state... [id=blog:AWS_DEPLOY_ROLE_ARN]
github_actions_secret.hans-m-song_huisheng_aws_ecr_image_publisher_role_arn: Refreshing state... [id=huisheng:AWS_ECR_IMAGE_PUBLISHER_ROLE_ARN]
github_actions_secret.hans-m-song_kube-stack_aws_ecr_image_publisher_role_arn: Refreshing state... [id=kube-stack:AWS_ECR_IMAGE_PUBLISHER_ROLE_ARN]
github_actions_repository_oidc_subject_claim_customization_template.hans-m-song["huisheng"]: Refreshing state... [id=huisheng]
github_actions_repository_oidc_subject_claim_customization_template.hans-m-song["iac"]: Refreshing state... [id=iac]
github_actions_repository_oidc_subject_claim_customization_template.hans-m-song["kube-stack"]: Refreshing state... [id=kube-stack]
github_actions_repository_oidc_subject_claim_customization_template.songmatrix["sync-service"]: Refreshing state... [id=sync-service]
github_actions_repository_oidc_subject_claim_customization_template.songmatrix["gateway"]: Refreshing state... [id=gateway]
github_actions_repository_oidc_subject_claim_customization_template.songmatrix["data-service"]: Refreshing state... [id=data-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # github_actions_repository_oidc_subject_claim_customization_template.axatol["actions"] will be created
  + resource "github_actions_repository_oidc_subject_claim_customization_template" "axatol" {
      + id                 = (known after apply)
      + include_claim_keys = [
          + "repo",
          + "context",
          + "workflow",
          + "job_workflow_ref",
          + "actor",
        ]
      + repository         = "actions"
      + use_default        = false
    }

  # github_actions_repository_oidc_subject_claim_customization_template.axatol["jayd"] will be created
  + resource "github_actions_repository_oidc_subject_claim_customization_template" "axatol" {
      + id                 = (known after apply)
      + include_claim_keys = [
          + "repo",
          + "context",
          + "workflow",
          + "job_workflow_ref",
          + "actor",
        ]
      + repository         = "jayd"
      + use_default        = false
    }

  # github_actions_repository_oidc_subject_claim_customization_template.hans-m-song["blog"] will be created
  + resource "github_actions_repository_oidc_subject_claim_customization_template" "hans-m-song" {
      + id                 = (known after apply)
      + include_claim_keys = [
          + "repo",
          + "context",
          + "workflow",
          + "job_workflow_ref",
          + "actor",
        ]
      + repository         = "blog"
      + use_default        = false
    }

  # github_actions_repository_oidc_subject_claim_customization_template.hans-m-song["saml2aws"] will be created
  + resource "github_actions_repository_oidc_subject_claim_customization_template" "hans-m-song" {
      + id                 = (known after apply)
      + include_claim_keys = [
          + "repo",
          + "context",
          + "workflow",
          + "job_workflow_ref",
          + "actor",
        ]
      + repository         = "saml2aws"
      + use_default        = false
    }

  # github_actions_repository_oidc_subject_claim_customization_template.songmatrix[".github"] will be created
  + resource "github_actions_repository_oidc_subject_claim_customization_template" "songmatrix" {
      + id                 = (known after apply)
      + include_claim_keys = [
          + "repo",
          + "context",
          + "workflow",
          + "job_workflow_ref",
          + "actor",
        ]
      + repository         = ".github"
      + use_default        = false
    }

  # github_actions_repository_oidc_subject_claim_customization_template.songmatrix["frontend-web"] will be created
  + resource "github_actions_repository_oidc_subject_claim_customization_template" "songmatrix" {
      + id                 = (known after apply)
      + include_claim_keys = [
          + "repo",
          + "context",
          + "workflow",
          + "job_workflow_ref",
          + "actor",
        ]
      + repository         = "frontend-web"
      + use_default        = false
    }

  # github_repository.axatol_jayd will be updated in-place
  ~ resource "github_repository" "axatol_jayd" {
      ~ description                 = "Youtube downloader server and frontend" -> "Just Another Youtube Downloader"
        id                          = "youtube-dl"
      ~ name                        = "youtube-dl" -> "jayd"
        # (30 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.actions_runner_controller_hans-m-song["blog"] will be created
  + resource "github_repository_webhook" "actions_runner_controller_hans-m-song" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "workflow_job",
        ]
      + id         = (known after apply)
      + repository = "blog"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.actions_runner_controller_hans-m-song["huisheng"] will be created
  + resource "github_repository_webhook" "actions_runner_controller_hans-m-song" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "workflow_job",
        ]
      + id         = (known after apply)
      + repository = "huisheng"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.actions_runner_controller_hans-m-song["iac"] will be created
  + resource "github_repository_webhook" "actions_runner_controller_hans-m-song" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "workflow_job",
        ]
      + id         = (known after apply)
      + repository = "iac"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.actions_runner_controller_hans-m-song["kube-stack"] will be created
  + resource "github_repository_webhook" "actions_runner_controller_hans-m-song" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "workflow_job",
        ]
      + id         = (known after apply)
      + repository = "kube-stack"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.actions_runner_controller_hans-m-song["saml2aws"] will be created
  + resource "github_repository_webhook" "actions_runner_controller_hans-m-song" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "workflow_job",
        ]
      + id         = (known after apply)
      + repository = "saml2aws"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.actions_runner_controller_hans-m-song-huisheng will be destroyed
  # (because github_repository_webhook.actions_runner_controller_hans-m-song-huisheng is not in configuration)
  - resource "github_repository_webhook" "actions_runner_controller_hans-m-song-huisheng" {
      - active     = true -> null
      - events     = [
          - "workflow_job",
        ] -> null
      - id         = "397854046" -> null
      - repository = "huisheng" -> null
      - url        = "https://api.github.com/repos/hans-m-song/huisheng/hooks/397854046" -> null

      - configuration {
          - content_type = "json" -> null
          - insecure_ssl = false -> null
          - url          = (sensitive value)
        }
    }

  # github_repository_webhook.actions_runner_controller_hans-m-song-iac will be destroyed
  # (because github_repository_webhook.actions_runner_controller_hans-m-song-iac is not in configuration)
  - resource "github_repository_webhook" "actions_runner_controller_hans-m-song-iac" {
      - active     = true -> null
      - events     = [
          - "workflow_job",
        ] -> null
      - id         = "398768556" -> null
      - repository = "iac" -> null
      - url        = "https://api.github.com/repos/hans-m-song/iac/hooks/398768556" -> null

      - configuration {
          - content_type = "json" -> null
          - insecure_ssl = false -> null
          - url          = (sensitive value)
        }
    }

  # github_repository_webhook.actions_runner_controller_hans-m-song-kube-stack will be destroyed
  # (because github_repository_webhook.actions_runner_controller_hans-m-song-kube-stack is not in configuration)
  - resource "github_repository_webhook" "actions_runner_controller_hans-m-song-kube-stack" {
      - active     = true -> null
      - events     = [
          - "workflow_job",
        ] -> null
      - id         = "397146056" -> null
      - repository = "kube-stack" -> null
      - url        = "https://api.github.com/repos/hans-m-song/kube-stack/hooks/397146056" -> null

      - configuration {
          - content_type = "json" -> null
          - insecure_ssl = false -> null
          - url          = (sensitive value)
        }
    }

  # github_repository_webhook.actions_runner_controller_hans-m-song-saml2aws will be destroyed
  # (because github_repository_webhook.actions_runner_controller_hans-m-song-saml2aws is not in configuration)
  - resource "github_repository_webhook" "actions_runner_controller_hans-m-song-saml2aws" {
      - active     = true -> null
      - events     = [
          - "workflow_job",
        ] -> null
      - id         = "400589329" -> null
      - repository = "saml2aws" -> null
      - url        = "https://api.github.com/repos/hans-m-song/saml2aws/hooks/400589329" -> null

      - configuration {
          - content_type = "json" -> null
          - insecure_ssl = false -> null
          - url          = (sensitive value)
        }
    }

  # github_repository_webhook.actions_runner_controller_hans-m-song_blog will be destroyed
  # (because github_repository_webhook.actions_runner_controller_hans-m-song_blog is not in configuration)
  - resource "github_repository_webhook" "actions_runner_controller_hans-m-song_blog" {
      - active     = true -> null
      - events     = [
          - "workflow_job",
        ] -> null
      - id         = "401172274" -> null
      - repository = "blog" -> null
      - url        = "https://api.github.com/repos/hans-m-song/blog/hooks/401172274" -> null

      - configuration {
          - content_type = "json" -> null
          - insecure_ssl = false -> null
          - url          = (sensitive value)
        }
    }

Plan: 11 to add, 1 to change, 5 to destroy.
```

</details>

*Pusher: @hans-m-song, Action: `pull_request`, Working Directory: `github`, Workflow: `Deploy Github`*